namespace CloudTextToSound
{
    /// <summary>
    /// 语音合成音色类型
    /// </summary>
    public enum VoiceTimbreType
    {
        /// <summary>
        /// ID：10510000 分类：阅读男声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智逍遥,

        /// <summary>
        /// ID：1001 分类：情感女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智瑜,

        /// <summary>
        /// ID：1002 分类：通用女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智聆,

        /// <summary>
        /// ID：1003 分类：客服女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智美,

        /// <summary>
        /// ID：1004 分类：通用男声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智云,

        /// <summary>
        /// ID：1005 分类：通用女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智莉,

        /// <summary>
        /// ID：1007 分类：客服女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智娜,

        /// <summary>
        /// ID：1008 分类：客服女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智琪,

        /// <summary>
        /// ID：1009 分类：知性女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智芸,

        /// <summary>
        /// ID：1010 分类：通用男声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智华,

        /// <summary>
        /// ID：1017 分类：情感女声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智蓉,

        /// <summary>
        /// ID：1018 分类：情感男声 音色：标准音色 语言：中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智靖,

        /// <summary>
        /// ID：1050 分类：英文男声 音色：标准音色 语言：英文 清晰度：8k/16k 情感：中性
        /// </summary>
        WeJack,

        /// <summary>
        /// ID：1051 分类：英文女声 音色：标准音色 语言：英文 清晰度：8k/16k 情感：中性
        /// </summary>
        WeRose,

        /// <summary>
        /// ID：101006 分类：助手女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智言,

        /// <summary>
        /// ID：101011 分类：新闻女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智燕,

        /// <summary>
        /// ID：101012 分类：新闻女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智丹,

        /// <summary>
        /// ID：101013 分类：新闻男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智辉,

        /// <summary>
        /// ID：101014 分类：新闻男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智宁,

        /// <summary>
        /// ID：101015 分类：男童声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智萌,

        /// <summary>
        /// ID：101016 分类：女童声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智甜,

        /// <summary>
        /// ID：101019 分类：粤语女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智彤,

        /// <summary>
        /// ID：101020 分类：新闻男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智刚,

        /// <summary>
        /// ID：101021 分类：新闻男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智瑞,

        /// <summary>
        /// ID：101022 分类：新闻女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智虹,

        /// <summary>
        /// ID：101023 分类：聊天女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智萱,

        /// <summary>
        /// ID：101024 分类：聊天男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智皓,

        /// <summary>
        /// ID：101025 分类：聊天女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智薇,

        /// <summary>
        /// ID：101026 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智希,

        /// <summary>
        /// ID：101027 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智梅,

        /// <summary>
        /// ID：101028 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智洁,

        /// <summary>
        /// ID：101029 分类：通用男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智凯,

        /// <summary>
        /// ID：101030 分类：通用男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智柯,

        /// <summary>
        /// ID：101031 分类：通用男声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智奎,

        /// <summary>
        /// ID：101032 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智芳,

        /// <summary>
        /// ID：101033 分类：客服女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智蓓,

        /// <summary>
        /// ID：101034 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智莲,

        /// <summary>
        /// ID：101035 分类：通用女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智依,

        /// <summary>
        /// ID：101040 分类：四川女声 音色：精品音色中文8k/16k 情感：中性
        /// </summary>
        智川,

        /// <summary>
        /// ID：101050 分类：英文男声 音色：精品音色英文8k/16k 情感：中性
        /// </summary>
        WeJack精品,

        /// <summary>
        /// ID：101051 分类：英文女声 音色：精品音色英文8k/16k 情感：中性
        /// </summary>
        WeRose精品,

        /// <summary>
        /// ID：101052 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智味,

        /// <summary>
        /// ID：101053 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智方,

        /// <summary>
        /// ID：101054 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智友,

        /// <summary>
        /// ID：101055 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智付,

        /// <summary>
        /// ID：101056 分类：东北男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智林,

        /// <summary>
        /// ID：301000 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小广,

        /// <summary>
        /// ID：301001 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小栋,

        /// <summary>
        /// ID：301002 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小海,

        /// <summary>
        /// ID：301003 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小霞,

        /// <summary>
        /// ID：301004 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小玲,

        /// <summary>
        /// ID：301005 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小章,

        /// <summary>
        /// ID：301006 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小峰,

        /// <summary>
        /// ID：301007 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小亮,

        /// <summary>
        /// ID：301008 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小博,

        /// <summary>
        /// ID：301009 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小芸,

        /// <summary>
        /// ID：301010 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小秋,

        /// <summary>
        /// ID：301011 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小芳,

        /// <summary>
        /// ID：301012 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小琴,

        /// <summary>
        /// ID：301013 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小康,

        /// <summary>
        /// ID：301014 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小辉,

        /// <summary>
        /// ID：301015 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小璐,

        /// <summary>
        /// ID：301016 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小阳,

        /// <summary>
        /// ID：301017 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小泉,

        /// <summary>
        /// ID：301018 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小昆,

        /// <summary>
        /// ID：301019 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小诚,

        /// <summary>
        /// ID：301020 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小岚,

        /// <summary>
        /// ID：301021 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小茹,

        /// <summary>
        /// ID：301022 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小蓉,

        /// <summary>
        /// ID：301023 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小燕,

        /// <summary>
        /// ID：301024 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小莲,

        /// <summary>
        /// ID：301025 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小武,

        /// <summary>
        /// ID：301026 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小雪,

        /// <summary>
        /// ID：301027 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小媛,

        /// <summary>
        /// ID：301028 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小娴,

        /// <summary>
        /// ID：301029 分类：通用男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性、高兴、生气、悲伤、恐惧、新闻、故事、广播、诗歌、客服
        /// </summary>
        爱小涛,
        /// <summary>
        /// ID：301030 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性
        /// </summary>
        爱小溪,

        /// <summary>
        /// ID：301031 分类：对话男声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性、悲伤、生气、高兴、恐惧、震惊、撒娇、厌恶
        /// </summary>
        爱小树,

        /// <summary>
        /// ID：301032 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性、悲伤、生气、高兴、恐惧、震惊、撒娇、厌恶
        /// </summary>
        爱小荷,

        /// <summary>
        /// ID：301033 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性、悲伤、生气、高兴、恐惧、震惊、撒娇、厌恶
        /// </summary>
        爱小叶,

        /// <summary>
        /// ID：301034 分类：对话男声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性、悲伤、生气、高兴、恐惧、震惊、撒娇、厌恶
        /// </summary>
        爱小杭,

        /// <summary>
        /// ID：301035 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性、悲伤、生气、高兴、恐惧、震惊、撒娇、厌恶
        /// </summary>
        爱小梅,

        /// <summary>
        /// ID：301036 分类：对话男声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性，悲伤，生气，高兴，恐惧，震惊，撒娇，厌恶
        /// </summary>
        爱小柯,

        /// <summary>
        /// ID：301037 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性
        /// </summary>
        爱小静,

        /// <summary>
        /// ID：301038 分类：对话女声 音色：精品音色 中文 清晰度：8k/16k/24k 情感：中性，平静，兴奋，诗歌，悲伤，生气，恐惧，撒娇，厌恶
        /// </summary>
        爱小桃,

        /// <summary>
        /// ID：401000 分类：活力女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智妍,

        /// <summary>
        /// ID：401001 分类：温暖女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        温柔智萱,

        /// <summary>
        /// ID：401002 分类：活力男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智飞,

        /// <summary>
        /// ID：401003 分类：活力女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智悦,

        /// <summary>
        /// ID：401004 分类：成熟男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智海,

        /// <summary>
        /// ID：401005 分类：新闻男声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智凡,

        /// <summary>
        /// ID：401006 分类：导航女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智航,

        /// <summary>
        /// ID：401007 分类：广告女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智婷,

        /// <summary>
        /// ID：401008 分类：通用女声 音色：精品音色 中文 清晰度：8k/16k 情感：中性
        /// </summary>
        智霞
    }
}
